<template>
  <div class="wrapper">
    <p>教室に誕生日ペアはいるかな</p>
    <div id="imput">
      <Forms />
      <p>同じ誕生日の人がいる割合は…</p>
      <button id="fff" onclick="clickBtn(),potion();">確認する</button>
    </div>

    <div id="output">
      <p id="answer"></p>
      <p id="caption"></p>
      <button id="mybtn" style="display: none"><p>説明</p></button>
    </div>
    <div id="slide">
      <div id="mymath">
        <p>何の割合を調べているのか</p>
        <p>
          複数の教室のうち、誕生日が同じペアがいる教室は全体の何割か？というのが問い。
        </p>
        <p>対象は教室の数。</p>
        <p>
          そこに「自分と同じ誕生日の人が教室にいたっけ？」という、似て異なる実体験を当てはめてしまうと直感に反した印象を受ける、のかな？
        </p>
        <p>ボタンを押すたびにペアのいる教室の割合が表示される。</p>
      </div>
      <div id="myjs">
        <p>JavaScriptでやっていること</p>
        <p>
          誕生日は365通りあるので、0から364までの数列からランダムに一つ選ぶ。
        </p>
        <p>これを生徒数だけ繰り返し一つの教室が出来上がる。</p>
        <p>
          setオブジェクトに重複した値を格納できないのを利用して、格納前と後で差があれば「重複あり」とカウントする。
        </p>
        <p>
          上記の処理2つを1セットとし、4649セット繰り返しカウントの有無の割合を出す。
        </p>
        <p>4649回なのは4649が素数なので割切れる事がないから。</p>
        <p>
          表示の都合で小数点3以下を切り捨てているため、割合を求める段階で割り切れてしまうと切り捨てた場合との区別がつかなくなる。
        </p>
        <p>そこで素数の性質を利用し割り切れないようにしている。</p>
        <p>また、生徒数が80名を超すあたりからほぼ100%に張り付く。</p>
        <p>
          80名の誕生日が全員違うのはかなり確率が低いため母数を増やさないと正しい確率を求められない。
        </p>
        <p>
          4649回で検出できない程の確率は無視してその代わり「ほぼ」を付けてごまかしている。。
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
import Forms from "./components/forms.vue";
</script>

<style>
</style>
